20231225090023-binary_numeric_promotion.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-01 Sun 15:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Binary Numeric Promotion</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Binary Numeric Promotion</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org91e6e8b">1. Binary Numeric Promotion</a>
<ul>
<li><a href="#org2727ac4">1.1. Rules</a></li>
<li><a href="#org162627b">1.2. Binary numeric promotion is applied in the following expressions:</a></li>
</ul>
</li>
<li><a href="#orgf23e1de">2. Examples</a></li>
<li><a href="#org2c1b152">3. <span class="underline">Exam Trick</span></a></li>
</ul>
</div>
</div>

<div id="outline-container-org91e6e8b" class="outline-2">
<h2 id="org91e6e8b"><span class="section-number-2">1.</span> Binary Numeric Promotion</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Binary Numeric Promotion</b> implicitly applies appropriate <code>widening</code> primitive conversions so that the <code>widest</code> numeric type of a pair of operands is always at least <code>int</code>.
</p>

<p>
If <code>T</code> is the <code>widest</code> numeric type of two operands after any <a href="20231225083210-java_boxing.html#ID-2af44b3c-ac25-4fc8-a372-20adc491f7f5">unboxing</a> conversions have been performed, the operands are <b>promoted</b> as follows during <b>binary numeric promotion</b>:
</p>

<p>
If <code>T</code> is <code>wider</code> than <code>int</code>, both operands are converted to <code>T</code>; otherwise, both operands are converted to <code>int</code>.
This means that the resulting type of the operands is <code>int</code>.
</p>
</div>

<div id="outline-container-org2727ac4" class="outline-3">
<h3 id="org2727ac4"><span class="section-number-3">1.1.</span> Rules</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>If two values have <b>different</b> data types, Java will automatically <code>widen</code> one of the values to the <code>widest</code> of the two data types.</li>

<li>If one of the values is <code>integral</code> and the other is <code>floating­point</code>, Java will automatically promote the <code>integral</code> value to the <code>floating­point</code> value’s data type.</li>

<li>Smaller data types, namely, <code>byte</code>, <code>short</code>, and <code>char</code>, are first promoted to <code>int</code> any time they’re used with a Java <a href="20231231061730-arithmetic_operators.html#ID-f6e458df-99cf-45d6-b224-16f325cc1d2b">Binary arithmetic Operator</a> with a variable (as opposed to a value), even if neither of the operands is <code>int</code>.
(<a href="20231231053308-unary_operators.html#ID-6fab7cdd-d658-4d28-a1b8-492fc3943dac">Unary Operators</a> are excluded from this rule).</li>

<li>After all promotion has occurred and the operands have the <b>same</b> data type, the <code>resulting value</code> will have the <b>same</b> data type as its promoted operands.</li>
</ol>
</div>
</div>

<div id="outline-container-org162627b" class="outline-3">
<h3 id="org162627b"><span class="section-number-3">1.2.</span> Binary numeric promotion is applied in the following expressions:</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Operands of the <a href="20231231061730-arithmetic_operators.html#ID-f6e458df-99cf-45d6-b224-16f325cc1d2b">Arithmetic Operators</a> <code>*, /, %, +,</code> and <code>-</code></li>
<li>Operands of the <a href="20231231063707-relational_operators.html#ID-bf93d4e3-f501-4e73-ac07-e1c6653831ba">Relational Operators</a> <code>&lt;, &lt;=, &gt;,</code> and <code>&gt;=</code></li>
<li>Operands of the <b>numerical</b> <a href="20231231063730-equality_operators.html#ID-700147ef-38e8-47dc-bdda-f675917ae802">Equality Operators</a> <code>==</code> and <code>!=</code></li>
<li>Operands of the <a href="20231231063743-conditional_operators.html#ID-a29b45cb-d2f6-49fd-90c7-4c8f1b8e898a">Conditional Operators</a> <code>? :</code>, under certain circumstances</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgf23e1de" class="outline-2">
<h2 id="orgf23e1de"><span class="section-number-2">2.</span> Examples</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-java"><span class="org-type">int</span> <span class="org-variable-name">x</span> = 1;
<span class="org-type">long</span> <span class="org-variable-name">y</span> = 33;
<span class="org-type">var</span> <span class="org-variable-name">z</span> = x * y; <span class="org-comment-delimiter">// </span><span class="org-comment">z is a long</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java"><span class="org-type">short</span> <span class="org-variable-name">x</span> = 1;
<span class="org-type">short</span> <span class="org-variable-name">y</span> = 33;
<span class="org-type">var</span> <span class="org-variable-name">z</span> = x * y; <span class="org-comment-delimiter">// </span><span class="org-comment">z is an int</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java"><span class="org-type">short</span> <span class="org-variable-name">w</span> = 14;
<span class="org-type">float</span> <span class="org-variable-name">x</span> = 13.0F;
<span class="org-type">double</span> <span class="org-variable-name">y</span> = 30;
<span class="org-type">var</span> <span class="org-variable-name">z</span> = w * x / y; <span class="org-comment-delimiter">// </span><span class="org-comment">double</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2c1b152" class="outline-2">
<h2 id="org2c1b152"><span class="section-number-2">3.</span> <span class="underline">Exam Trick</span></h2>
<div class="outline-text-2" id="text-3">
<p>
<code>short</code> values are automatically promoted to <code>int</code> when applying any <a href="20231231061730-arithmetic_operators.html#ID-f6e458df-99cf-45d6-b224-16f325cc1d2b">Arithmetic Operators</a>, with the resulting value being of type <code>int</code>.
Trying to assign a <code>short</code> variable with an <code>int</code> value results in a <b>compiler error</b>, as Java thinks you are trying to implicitly convert
from a <code>wider</code> data type to a <code>smaller</code> one.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-type">short</span> <span class="org-variable-name">mouse</span> = 10;
<span class="org-type">short</span> <span class="org-variable-name">hamster</span> = 3;
<span class="org-type">short</span> <span class="org-variable-name">capybara</span> = mouse * hamster;<span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE</span>
</pre>
</div>

<p>
We can fix this expression by <a href="20231224190739-widening_primitive_conversion.html#ID-3ef23225-ae37-428e-8ad3-5d7728f59478">casting</a>, as <b>there are times that you may want to override the compiler’s default behavior</b>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-type">short</span> <span class="org-variable-name">mouse</span> = 10;
<span class="org-type">short</span> <span class="org-variable-name">hamster</span> = 3;
<span class="org-type">short</span> <span class="org-variable-name">capybara</span> = (<span class="org-type">short</span>)(mouse * hamster);
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
